# Indexação em Pandas

Explorando como selecionar, filtrar, modificar e manipular dados em DataFrames usando Pandas.

In [1]:
import pandas as pd
import numpy as np

## Criando um DataFrame de Exemplo

In [2]:
data = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana', 'Eduardo'],
    'Idade': [23, 34, 45, 28, 33],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Porto Alegre', 'Salvador']
}

df = pd.DataFrame(data)

## Indexação Básica

In [3]:
# Selecionar uma Coluna
nomes = df['Nome']
print(nomes)

0        Ana
1      Bruno
2     Carlos
3      Diana
4    Eduardo
Name: Nome, dtype: object

## Indexação com `.loc` e `.iloc`

In [4]:
# Selecionar Linhas por Rótulo com `.loc`
carlos = df.loc[2]
print(carlos)

Nome              Carlos
Idade                 45
Cidade    Belo Horizonte
Name: 2, dtype: object

In [8]:
# Usando .loc para fatiar
slice_loc = df.loc[1:3]
slice_loc

     Nome  Idade          Cidade
1   Bruno     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte
3   Diana     28    Porto Alegre

In [10]:

# Usando .iloc para fatiar
slice_iloc = df.iloc[1:3]
slice_iloc

     Nome  Idade          Cidade
1   Bruno     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte

## Condições Booleanas para Filtragem

In [11]:
# Filtrar com Condições
maiores_de_30 = df[df['Idade'] > 30]
print(maiores_de_30)

      Nome  Idade          Cidade
1    Bruno     34  Rio de Janeiro
2   Carlos     45  Belo Horizonte
4  Eduardo     33        Salvador

## Modificando Dados

In [13]:
# Modificar um Valor Específico
df.at[0, 'Idade'] = 24
df

      Nome  Idade          Cidade
0      Ana     24       São Paulo
1    Bruno     34  Rio de Janeiro
2   Carlos     45  Belo Horizonte
3    Diana     28    Porto Alegre
4  Eduardo     33        Salvador

In [14]:
#modificar uma linha inteira
df.loc[4] = ['Fernanda', 29, 'Curitiba']
print(df)

       Nome  Idade          Cidade
0       Ana     24       São Paulo
1     Bruno     34  Rio de Janeiro
2    Carlos     45  Belo Horizonte
3     Diana     28    Porto Alegre
4  Fernanda     29        Curitiba

### Manipulação Avançada

-   **Adicionar e Remover Colunas**:

In [19]:
# Adicionando uma nova coluna
df['Ano de Nascimento'] = 2024 - df['Idade']
df

       Nome  Idade          Cidade  Ano de Nascimento
0       Ana     24       São Paulo               2000
1     Bruno     34  Rio de Janeiro               1990
2    Carlos     45  Belo Horizonte               1979
3     Diana     28    Porto Alegre               1996
4  Fernanda     29        Curitiba               1995

In [18]:
# Removendo uma coluna
df.drop('Ano de Nascimento', axis=1, inplace=True)
df

       Nome  Idade          Cidade
0       Ana     24       São Paulo
1     Bruno     34  Rio de Janeiro
2    Carlos     45  Belo Horizonte
3     Diana     28    Porto Alegre
4  Fernanda     29        Curitiba

**Ordenação de Dados**:

In [22]:
df.sort_values(by='Idade', inplace=True)
df

       Nome  Idade          Cidade  Ano de Nascimento
0       Ana     24       São Paulo               2000
3     Diana     28    Porto Alegre               1996
4  Fernanda     29        Curitiba               1995
1     Bruno     34  Rio de Janeiro               1990
2    Carlos     45  Belo Horizonte               1979

## Conclusão

Este notebook ofereceu uma visão abrangente da indexação em Pandas, demonstrando como selecionar, filtrar, modificar e manipular dados em DataFrames.